# CreateFrameworkElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFrameworkElementCreator..::..CreateFrameworkElement Method
IFrameworkElementCreator Interface See Also
---
Method called to create the FrameworkElement.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
FrameworkElement CreateFrameworkElement()
```

Visual Basic
---
```text
Function CreateFrameworkElement As FrameworkElement
```

Visual C++
---
```text
FrameworkElement^ CreateFrameworkElement()
```

# See Also
IFrameworkElementCreator Interface
Autodesk.Revit.UI Namespace